
a = input("Введите месяц рождения : ")
b = int(input("Введите день рождения : "))
age = int(input('Введите год рождения : '))

print("Вам", 2020-age, "года/лет")

if a == "декабрь":
    if b > 21:
        print("Ващ знак зодиака : Козерог")
    if b < 22:
        print("Ващ знак зодиака : Стрелец")

if a == "январь":
    if b > 20:
        print("Ващ знак зодиака : Водолей")
    if b < 21:
        print("Ващ знак зодиака : Козерог")

if a == "февраль":
    if b < 21:
        print("Ващ знак зодиака : Водолей")
    if b > 20:
        print("Ващ знак зодиака : Рыбы")

if a == "март":
    if b < 22:
        print("Ващ знак зодиака : Рыбы")
    if b > 20:
        print("Ващ знак зодиака : Овен")

if a == "апрель":
    if b < 21:
        print("Ващ знак зодиака : Овен")
    if b > 20:
        print("Ващ знак зодиака : Телец")

if a == "май":
    if b < 21:
        print("Ващ знак зодиака : Телец")
    if b > 20:
        print("Ващ знак зодиака : Блезнецы")

if a == "июнь":
    if b < 22:
        print("Ващ знак зодиака : Близнецы")
    if b > 21:
        print("Ващ знак зодиака : Рак")

if a == "июль":
    if b < 23:
        print("Ващ знак зодиака : Рак")
    if b > 22:
        print("Ващ знак зодиака : Лев")

if a == "август":
    if b < 24:
        print("Ващ знак зодиака : Лев")
    if b > 23:
        print("Ващ знак зодиака : Дева")

if a == "сентябрь":
    if b < 24:
        print("Ващ знак зодиака : Дева")
    if b > 23:
        print("Ващ знак зодиака : Весы")

if a == "октябрь":
    if b < 24:
        print("Ващ знак зодиака : Весы")
    if b > 23:
        print("Ващ знак зодиака : Скорпион")

if a == "ноябрь":
    if b < 23:
        print("Ващ знак зодиака : Скорпион")
    if b > 22:
        print("Ващ знак зодиака : Стрелец")
